export const aboutData = [
  {
    title: "사용자 경험을 최우선으로 생각하는 프론트엔드 개발자",
    subtitle: "성능 최적화와 사용자 경험 개선에 집중했습니다.",
    content: [
      "초기 로딩 속도 개선을 위해 라이프사이클 최적화, 코드 스플리팅, 이미지 최적화 등을 진행하여 초기 로딩 시간을 2.8s -> 1.3s(53%)로 단축하고, 번들 사이즈 32% 감소시켰습니다.",
      "Suspense와 Skeleton UI를 조합해 데이터 로딩 상태를 최적화하고, CLS 점수를 0으로 개선시켜 사용자 경험을 향상시켰습니다.",
      "사용자 경험 개선을 위해 컴포넌트와 루트 레벨의 ErrorBoundary를 구현해 API 에러를 처리하고, 커스텀 에러 페이지와 Toastify 기반 Toast 컴포넌트로 사용자 친화적인 에러 알림을 구현했습니다.",
      // "구글 폼을 통한 사용자 피드백을 수집하고, 이를 바탕으로 UI/UX를 개선해 서비스 만족도를 향상시켰습니다.",
    ],
  },
  {
    title: "효율적인 개발 환경과 코드 품질을 추구합니다",
    subtitle: "팀과 함께 성장하며, 개발 프로세스의 효율화를 위해 고민합니다.",
    content: [
      "Notion을 활용한 코드 컨벤션 정립, 스프린트 일정 등 체계적으로 문서화하여 팀 협업 효율과 개발 생산성을 향상시켰습니다.",
      // 코드 컨벤션(ESLint, Prettier, 네이밍, 파일/디렉토리 구조 규칙, 커밋 컨벤션, 깃 브랜치 전략), 기술 문서(API 명세서, 컴포넌트 문서화(JSDoc), 프로젝트 관리 (스프린트 일정, 테스트 관리 및 우선순위, 회의록 및 의사결정 사항))
      "ESLint, Prettier, TailwindCSS 규칙을 커스텀하여 일관된 코드 품질과 스타일을 유지하고, JSDoc을 활용한 컴포넌트 문서화로 DX(개발자 경험)를 개선했습니다.",
      // "다양한 프로젝트를 통해 경험한 기술과 팀 협업 경험을 바탕으로 스스로 더 나은 방법을 고민하고 배워나가고 있습니다.",
    ],
  },
  {
    title: "끊임없이 배우고 도전하는 개발자",
    subtitle: "새로운 기술과 트렌드에 대한 호기심으로 성장합니다",
    content: [
      "공식 문서를 통해 새로운 기술을 배우고 적용하며, 이를 통해 지속적인 성장을 추구합니다.",
      "기술 블로그와 깃허브를 통해 배운 내용을 기록하고 공유하며 성장해 나가고 있습니다.",
    ],
  },
];
