export const aboutData = [
  {
    title: "사용자 경험을 최우선으로 생각하는 프론트엔드 개발자",
    subtitle: "성능 최적화와 사용자 경험 개선에 집중했습니다.",
    content: [
      "초기 로드 속도 개선을 위한 라이프사이클 최적화, 코드 스플리팅, 이미지 로더 등의 작업을 통해 초기 로딩 시간을 2.8s -> 1.3s로 단축하고, 번들 사이즈 25% 감소시킨 경험이 있습니다.",
      "데이터 로딩 상태를 개선하고자 Skeleton UI 구현으로 사용자 이탈률을 감소시키고, 페이지 체류 시간을 증가시켰습니다.",
      "구글 폼을 통한 사용자 피드백을 수집하고, 이를 바탕으로 UI/UX를 개선해 서비스 만족도를 향상시켰습니다.",
    ],
  },
  {
    title: "효율적인 개발 환경과 코드 품질을 추구합니다",
    subtitle: "팀과 함께 성장하며, 개발 프로세스의 효율화를 위해 고민합니다.",
    content: [
      "Notion을 활용해 프로젝트 일정 관리, 회의록 정리 등 프로젝트 문서화 구축을 통한 팀 협업 효율을 향상시켰습니다.",
      "ESLint, Prettier 규칙을 커스텀하여 일관된 코드 품질과 스타일을 유지하고, JSDoc을 활용한 컴포넌트 문서화로 DX(개발자 경험)를 개선했습니다.",
      "다양한 프로젝트를 통해 경험한 기술과 팀 협업 경험을 바탕으로 스스로 더 나은 방법을 고민하고 배워나가고 있습니다.",
    ],
  },
  {
    title: "끊임없이 배우고 도전하는 개발자",
    subtitle: "새로운 기술과 트렌드에 대한 호기심으로 성장합니다",
    content: [
      "공식 문서를 통해 새로운 기술을 배우고 적용하며, 이를 통해 지속적인 성장을 추구합니다.",
      "기술 블로그와 깃허브를 통해 배운 내용을 기록하고 공유하며 성장해 나가고 있습니다.",
      "현재는 오픈 소스 프로젝트를 분석하고 학습하며 성장해 나가고 있습니다.",
    ],
  },
];
